import styled from "styled-components"
import Announcement from "../../components/Announcement"
import Navbar from "../../components/Navbar"
import TopNavbar from "../../components/TopNavbar"
import Footer from "../../components/Footer";

const Container = styled.div`
  
`

const ContainerItems = styled.div`
  padding:50px; 
`
const Title = styled.h1`
  color:#000;
  padding-bottom: 20px;
`
const SubTitle = styled.h2`
  color:#000;
  padding-bottom: 20px;
`
const Desc = styled.p`
  width: 100%;
  font-size: 16px;
  padding-bottom: 10px;
  margin-left: 20px;
  margin-bottom: 10px;
`

const A = styled.a`
  font-size: 16px;
  padding-bottom: 10px;
  margin-left: 20px;
  color: #168858;
`

const Option = styled.p`
  font-size: 18px;
  font-weight: 300;
  padding-top: 10px;
  margin-left: 20px;
`

const Obmen = () =>{
    return(
        <Container>
            <TopNavbar/>
            <Announcement/>
            <Navbar/>
            <ContainerItems>
                <Title>
                    Условия обмена/возврата товара
                </Title>
                <Desc>
                    Если товар надлежащего качества
                    Согласно статье 30 Закона Республики Казахстан “О защите прав потребителя”, вы можете обменять или вернуть, приобретенный у нас товар в течение 14 дней с момента покупки, если он надлежащего качества, то есть товар не был в употреблении, сохранены его товарный вид, потребительские свойства, пломбы, ярлыки, а также документ, подтверждающий факт приобретения товара (чек).
                </Desc>
                <br/>
                <Desc>
                    Обмен товара надлежащего качества производится на аналогичный товар или товар другого размера, формы, габарита, фасона, расцветки, комплектации и тому подобное по соглашению сторон, произведя в случае разницы в цене необходимый перерасчет с продавцом.
                </Desc>
                <SubTitle>Если товар ненадлежащего качества:</SubTitle>
                <Desc>
                    <p>
                        1. При обнаружении неисправностей или дефектов в процессе эксплуатации, обратитесь в авторизованный производителем сервисный центр, указанный в гарантийном талоне.
                    </p>
                    <p>
                        2. Если случай гарантийный и срок гарантии не истёк - возможен ремонт за счёт производителя, обмен на аналогичный товар или возврат стоимости товара. В случае, если товар был приобретен в кредит/рассрочку, то возврат денег осуществляется в банк (за исключением случаев, когда кредит оплачен).
                    </p>
                    <p>3. Если в результате проверки (экспертизы) товара авторизованным сервисным центром установлено, что недостатки товара отсутствуют или возникли после передачи товара потребителю вследствие нарушения им установленных правил использования, хранения или действий третьих лиц либо непреодолимой силы, механических повреждений и тому подобное, условия гарантии не распространяются на такой товар.</p>
                </Desc>
                <SubTitle>Товары, приобретенные по акции и в подарок:</SubTitle>
                <Desc>
                    <p>1. Товары, приобретенные по акции, предусматривающей приобретение второго и/или последующих товаров по специальной цене или со скидкой, вне зависимости от цены товара и позиции в чеке, могут быть возвращены только полным списком, указанным в чеке/накладной.
                        Требования к возвращаемым акционным товарам при его возврате или обмене аналогичны требованиям законодательства и требованиям, указанным в настоящем разделе.</p>
                    <p>
                        Например, если вы купили телевизор по акции с телевизором или другими товарами по специальной цене (скидками), возврату подлежат все товары, указанные в таком чеке или накладной с отметкой «акция*» и все товары должны соответствовать вышеуказанным требованиям.
                    </p>
                    <p>
                        Продавец вправе отказать в возврате акционного товара, если один или более из сопутствующих товаров не соответствуют вышеуказанным требованиям.
                    </p>
                </Desc>
                <SubTitle>Данное условие не применяется при возврате акционного товара, по гарантийному случаю, подтвержденному авторизованным заводом-изготовителем сервисным центром</SubTitle>
                <Desc>Отказ от покупки до получения товара и во время доставки
                    В сети магазинов «Keitlin» отказаться от оплаченного и не оплаченного товара можно в любое время до его получения.
                    Если вы решили отказаться во время доставки – не принимайте товар. Причину укажите в товарном чеке или накладных на доставку товара.
                    Если товар имеет внешние повреждения, то мы заменим товар бесплатно, повторная доставка или пересылка будет осуществлена за счёт продавца.</Desc>
                <Title>Отказ от покупки после доставки</Title>
                <SubTitle>Товар надлежащего качества</SubTitle>
                <Desc>
                    <p>
                        Если товар надлежащего качества - если он не был в употреблении, сохранены товарный вид, фирменная упаковка, пломбы и ярлыки, гарантийный талон и инструкция по эксплуатации, но вас не устраивает по габаритам, цвету или техническим характеристикам, то отказаться или обменять на аналогичный или другой товар можно в течение 14 дней со дня приобретения товара.
                    </p>
                    <p>
                        Возврату и обмену не подлежат товары надлежащего качества, перечень которых установлен Законом "О защите прав потребителей", в том числе абонентские устройства сотовой связи.

                        Если при покупке товара к нему был приложен подарок, то в случае его возврата подарок к нему также подлежит возврату в надлежащем виде, т.е. не должен иметь следы эксплуатации, должны быть сохранены его товарный вид, потребительские свойства, фабричная (родная) упаковка, пломбы, инструкции и т.д.
                    </p>
                </Desc>
                <SubTitle>Товар ненадлежащего качества</SubTitle>
                <Desc>
                    При обнаружении неисправностей или дефектов в процессе эксплуатации, обратитесь в авторизованный производителем сервисный центр, указанный в гарантийном талоне.
                    Если случай гарантийный, срок гарантии не истёк - возможен ремонт за счёт производителя, замена товара, возврат денег.
                    На механические повреждения гарантия не распространяется, вернуть товар нельзя.
                    Если сервисный центр не может отремонтировать технику, а срок гарантии не истёк, пожалуйста, получите техническое заключение с перечнем неисправностей.
                </Desc>
                <Title>Возврат денег</Title>
                <SubTitle>
                    Возврат денег производим в течение 5 рабочих дней:
                </SubTitle>
                <Desc>
                    Если товар вам не был доставлен, с момента подачи заявления.
                    Если вы возвращаете доставленный товар, то после того как мы получим от вас товар.
                </Desc>
                <SubTitle>
                    Если вы покупали:
                </SubTitle>
                <Desc>
                    Банковскими картами -  возврат осуществляется на карту, с которой была осуществлена покупка.
                    Безналичным банковским переводом как юридическое лицо – возврат только на банковский счёт предприятия.
                </Desc>
            </ContainerItems>
            <Footer/>
        </Container>
    )
}

export default Obmen