import styled from "styled-components"
import Announcement from "../../components/Announcement"
import Navbar from "../../components/Navbar"
import TopNavbar from "../../components/TopNavbar"
import Footer from "../../components/Footer";

const Container = styled.div`
  
`

const ContainerItems = styled.div`
  padding:50px; 
`
const Title = styled.h1`
  color:#000;
  padding-bottom: 20px;
`
const SubTitle = styled.h2`
  color:#000;
  padding-bottom: 20px;
`
const Desc = styled.p`
  width: 100%;
  font-size: 16px;
  padding-bottom: 10px;
  margin-left: 20px;
  margin-bottom: 10px;
`

const A = styled.a`
  font-size: 16px;
  padding-bottom: 10px;
  margin-left: 20px;
  color: #168858;
`

const Option = styled.p`
  font-size: 18px;
  font-weight: 300;
  padding-top: 10px;
  margin-left: 20px;
`

const Ship = () =>{
    return(
        <Container>
            <TopNavbar/>
            <Announcement/>
            <Navbar/>
            <ContainerItems>
                <Title>
                    Условия получения товара при Доставке
                </Title>
                <SubTitle>
                    1. Дата и Время
                </SubTitle>
                <Desc>
                    При покупке в интернет-магазине, дата доставки будет указана в личном кабинете, а также в СМС-уведомлении.
                    Доставка осуществляется в порядке очереди. Курьер звонит по указанному в заявке номеру за 1 час до приезда.
                </Desc>
                <Desc>
                    В случае вашего отсутствия по адресу, в назначенное время, курьер ожидает не более 15 минут, после чего оставляет извещение о доставке.
                </Desc>
                <Desc>
                    Для повторной доставки нужно повторно ее оформить и оплатить.
                </Desc>
                <SubTitle>
                    2. Кому передадут товар:
                </SubTitle>
                <Desc>
                    При заказе товара с интернет-магазина компании или партнеров, лицу, которое предоставит СМС-уведомление или СМС-код, подтверждающий получение заказа.
                </Desc>
                <SubTitle>
                    3. Куда и как доставят?
                </SubTitle>
                <Desc>
                    Товар будет доставлен по указанному вами адресу и занесен до входной двери квартиры/дома, за исключением случаев, когда:
                    Потребуется снятие с петель дверей в помещении;
                    Потребуется снятие упаковки, либо любых частей товара с целью уменьшения его габаритных размеров;
                    Расстояние между товаром и окружающими предметами (частями помещения) составляет менее десяти сантиметров.
                    В этих случаях товар будет передан вам в том месте, до которого удалось осуществить доставку.
                </Desc>
                <SubTitle>
                    4. Изменение данных доставки
                </SubTitle>
                <Desc>
                    При изменениях адреса или контактного телефона после оплаты покупки, вам необходимо обратиться в Службу доставки и назвать номер заказа.
                </Desc>
                <SubTitle>
                    5. Проверьте товар на:
                </SubTitle>
                <Desc>
                    Отсутствие видимых механических повреждений;
                    Наличие всех предметов, входящих в комплект;
                    Наличие инструкции по эксплуатации;
                    Правильность заполнения гарантийного талона (наличие печатей и соответствие маркировке товара).
                    После приемки товара и подписания сопроводительных документов претензии по внешнему виду, комплектности, наличию документации не принимаются.

                    В случае отказа от подписания сопроводительных документов о получении товара, товар будет возвращен в магазин, повторная доставка осуществляется после ее оплаты, за исключением видимых повреждений товара. В этом случае повторная доставка товара будет бесплатной.
                </Desc>
                <SubTitle>
                    6. Заполните документы
                </SubTitle>
                <Desc>
                    Наличие царапин, трещин, сколов, вмятин или некомплектность Товара, а также претензии к работе службы доставки отмечаются Вами в сопроводительном документе.
                </Desc>
                <SubTitle>
                    7. В обязанности службы доставки не входит:
                </SubTitle>
                <Desc>
                    <p>Утилизация упаковки;</p>
                    <p>Консультирование по возможностям и характеристикам доставленного товара;</p>
                    <p>Настройка и установка техники;</p>
                    <p>Обучение пользованию доставленной техникой;</p>
                    <p>Подключение техники к сетям.</p>
                </Desc>
            </ContainerItems>
            <Footer/>
        </Container>

    )
}

export default Ship